In [1]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
con = engine.connect()
engine = create_engine("mysql+pymysql://root:@localhost:3306/portfolio_development")
conpf = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3")
conlite = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3")
conlt = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3")
conmy = engine.connect()
engine = create_engine(
    "postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development"
)
conpg = engine.connect()

In [44]:
name = "DTAC"

### MySQL Stock Database

In [45]:
sql = '''
DELETE FROM price
WHERE name = "%s"'''
sql = sql % name
print(sql)

DELETE FROM price
WHERE name = "DTAC"

In [46]:
rp = con.execute(sql)
rp.rowcount

953

In [47]:
sql = '''
DELETE FROM nameall
WHERE name = "%s"'''
sql = sql % name
print(sql)

DELETE FROM nameall
WHERE name = "DTAC"

In [48]:
rp = con.execute(sql)
rp.rowcount

1

In [49]:
sql = '''
DELETE FROM stockname
WHERE name = "%s"'''
sql = sql % name
print(sql)

DELETE FROM stockname
WHERE name = "DTAC"

In [50]:
rp = con.execute(sql)
rp.rowcount

1

### PostgreSQL PortPg Database

In [51]:
sql = """
SELECT * FROM yr_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

SELECT * FROM yr_profits
WHERE name = 'DTAC'

In [52]:
df = pd.read_sql(sql, conpg)
df

,id,name,year,quarter,latest_amt,previous_amt,inc_amt,inc_pct,ticker_id
0,2393232,DTAC,2020,1,5515131,-4275061,9790192,229.010000,150
1,2393231,DTAC,2020,2,5709482,-2759743,8469225,306.884554,150
2,2393230,DTAC,2020,3,5327983,-21093,5349076,25359.484189,150
3,2393229,DTAC,2020,4,5107119,5421893,-314774,-5.805611,150
4,2393228,DTAC,2021,1,4427817,5515131,-1087314,-19.720000,150
5,2393227,DTAC,2021,2,4069550,5709482,-1639932,-28.722956,150
6,2393226,DTAC,2021,3,3465917,5327983,-1862066,-34.950000,150
7,2393225,DTAC,2021,4,3355933,5107119,-1751186,-34.290000,150
8,2393224,DTAC,2022,1,3260225,4427817,-1167592,-26.370000,150
9,2393223,DTAC,2022,2,2733414,4069550,-1336136,-32.830000,150
10,2393222,DTAC,2022,3,2389347,3465917,-1076570,-31.060000,150
11,2393221,DTAC,2022,4,3119157,3355933,-236776,-7.060000,150

In [53]:
sql = """
DELETE FROM yr_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM yr_profits
WHERE name = 'DTAC'

In [54]:
rp = conpg.execute(sql)
rp.rowcount

12

In [55]:
sql = """
DELETE FROM epss
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM epss
WHERE name = 'DTAC'

In [56]:
rp = conpg.execute(sql)
rp.rowcount

19

In [57]:
sql = """
DELETE FROM consensus
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM consensus
WHERE name = 'DTAC'

In [58]:
rp = conpg.execute(sql)
rp.rowcount

1

In [59]:
sql = """
DELETE FROM stocks
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM stocks
WHERE name = 'DTAC'

In [60]:
rp = conpg.execute(sql)
rp.rowcount

1

In [61]:
sql = """
DELETE FROM charts
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM charts
WHERE name = 'DTAC'

In [63]:
rp = conpg.execute(sql)
rp.rowcount

0

In [64]:
sql = """
DELETE FROM profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM profits
WHERE name = 'DTAC'

In [65]:
rp = conpg.execute(sql)
rp.rowcount

0

In [66]:
sql = """
DELETE FROM tickers
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM tickers
WHERE name = 'DTAC'

In [67]:
rp = conpg.execute(sql)
rp.rowcount

1

### SQLite PortMy Database

In [68]:
sql = """
DELETE FROM stocks
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM stocks
WHERE name = 'DTAC'

In [69]:
rp = conmy.execute(sql)
rp.rowcount

1

In [70]:
sql = """
DELETE FROM tickers
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM tickers
WHERE name = 'DTAC'

In [71]:
rp = conmy.execute(sql)
rp.rowcount

1

### SQLite PortLt Database

In [72]:
sql = """
DELETE FROM yr_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM yr_profits
WHERE name = 'DTAC'

In [73]:
rp = conlt.execute(sql)
rp.rowcount

12

In [74]:
sql = """
DELETE FROM qt_profits
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM qt_profits
WHERE name = 'DTAC'

In [75]:
rp = conlt.execute(sql)
rp.rowcount

13

In [76]:
sql = """
DELETE FROM epss
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM epss
WHERE name = 'DTAC'

In [77]:
rp = conlt.execute(sql)
rp.rowcount

19

In [78]:
sql = """
DELETE FROM stocks
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM stocks
WHERE name = 'DTAC'

In [79]:
rp = conlt.execute(sql)
rp.rowcount

1

In [80]:
sql = """
DELETE FROM tickers
WHERE name = '%s'
"""
sql = sql % name
print(sql)

DELETE FROM tickers
WHERE name = 'DTAC'

In [81]:
rp = conlt.execute(sql)
rp.rowcount

1

### MySQL Portfolio Database

In [82]:
sql = """
SELECT * FROM stocks
WHERE name = '%s'
"""
sql = sql % name
df = pd.read_sql(sql, conpf)
df

    id  name  category_id website
0  152  DTAC            1

### Delete from name-ttl.csv manually